Repository: OssianEriksson/wp-google-auth
Catalog: languages/wp-google-auth-*.po
Languages: sv_se

source: WP Google Auth
sv_se: WP Googleautentisering

source: WordPress plugin for syncing WordPress users with Google Workspace users.
sv_se: WordPress-plugin för synkronisering av WordPress-användare med Google Workspace-användare.

source: <strong>Error</strong>: Malformatted response to OpenID authentication request. Please try logging in again later.
sv_se: <strong>Fel</strong>: Felformatterat svar på OpenID-autentiseringsfrågan. Var god försök igen senare.

source: <strong>Error</strong>: Anti-forgery state token mismatch. Please try logging in again.
sv_se: <strong>Fel</strong>: Anti-förfalskningsnyckeln matchade inte. Var god försök igen senare.

source: <strong>Error</strong>: There was an error reading the Google API discovery document. Please try logging in again later.
sv_se: <strong>Fel</strong>: Ett problem uppstod vid inläsningen av Google-API:ts katalog. Var god försök igen senare.

source: <strong>Error</strong>: There was an error recieving the Google OAuth access token. Please try logging in again later.
sv_se: <strong>Fel</strong>: Ett fel uppstod vid mottagandet av en OAuth-accessnyckel från Google. Var god försök igen senare.

source: <strong>Error</strong>: There was an error fetching user info from Google. Please try logging in again later.
sv_se: <strong>Fel</strong>: Ett fel uppstod vid hämtingen av användarinformation från Google. Var god försök igen senare.

source: <strong>Error</strong>: Sorry, your account cannot login to this site.
sv_se: <strong>Fel</strong>: Tyvärr, ditt användarkonto kan inte logga in på denna sida.

source: <strong>Error</strong>: OpenID login error. Please try logging in again later.
sv_se: <strong>Fel</strong>: Inloggningsfel med OpenID. Var god försök igen senare.

source: Since the Google OpenID login failed, you were taken to the default WordPress login page. If you want to attempt another sign in with Google, click <a %s>here</a>.
sv_se: Då inloggningen med Googles OpenID misslyckades togs du till den vanliga inloggningssidan för WordPress. Om du vill försöka logga in med Google igen, klicka <a %s>här</a>.

source: There was an error reading the Google API discovery document, please try again later.
sv_se: Ett problem uppstod vid inläsningen av Google-API:ts katalog. Var god försök igen senare.

source: An OpenID error was detected: %1$s
sv_se: Ett OpenID-fel upptäcktes: %1$s

source: Client secret cannot be empty.
sv_se: Klienthemligheten kan inte lämnas tom.

source: Google Auth
sv_se: Googleautentisering

source: OAuth Client
sv_se: OAuth-klient

source: To perform logins with Google, this plugin needs access to a Google OAuth client id and secret. To create a Google OAuth client as a Google Workspace admin you can follow the instrcutions <a %1$s>here</a>.
sv_se: För att kunna logga in användare med Google behöver detta plugin tillgång till ett Google OAuth klient-id och en klienthemlighet. För att skapa en Google OAuth-klient som en Google Workspace-administratör, följ instruktionerna <a %1$s>här</a>.

source: Settings
sv_se: Inställningar

source: The following error has occurred:
sv_se: Följande fel har inträffat:

source: Email regex pattern
sv_se: Regex-mönster för e-mejl

source: Select roles
sv_se: Välj roller

source: Google OAuth client ID
sv_se: Google OAturh klient-ID

source: Google OAuth client secret
sv_se: Google OAuth klienthemlighet

source: Account Settings
sv_se: Inställningar för användarkonton

source: Here you can enter regex pattern to be matched against user emails. For every match, you can select which roles should be applied to the user.
sv_se: Här kan du fylla i regex-mönster som kommer matchas mot användares e-mejladdresser. För varje matchning kan du välja vilka roller som ska tilldelas till motsvarande matchning.

source: Add pattern
sv_se: Lägg till mönster

source: Miscellaneous Settings
sv_se: Övriga inställningar

source: Cache refresh interval (hours)
sv_se: Cacheuppdateringsintervall (timmar)

source: Settings saved! Please test out the login functionality to verify that everything is working as expected.
sv_se: Ändrigarna sparade! Var god att prova inloggningsfuntionaliteten för att säkerställa att allting fungerar som förväntat.

source: Save changes
sv_se: Spara ändringar

source: WP Google Auth Settings
sv_se: Inställningar för WP Googleautentisering
